<?php

return [
    'admin' => [
        'menu' => [
            'push-notification' => 'पुश नोटिफिकेशन',
        ],

        'acl' => [
            'push-notification' => 'पुश नोटिफिकेशन',
            'send' => 'भेजें',
        ],

        'system' => [
            'graphql-api' => 'जीक्वेल एपीआई',
            'push-notification-configuration' => 'एफसीएम पुश नोटिफिकेशन कॉन्फ़िगरेशन',
            'server-key' => 'सर्वर कुंजी',
            'info-get-server-key' => 'जानकारी: एफसीएम एपीआई क्रेडेंशियल्स प्राप्त करने के लिए: <a href="https://console.firebase.google.com/" target="_blank">यहाँ क्लिक करें</a>',
            'android-topic' => 'एंड्रॉइड टॉपिक',
            'ios-topic' => 'आईओएस टॉपिक',
        ],

        'notification' => [
            'title' => 'पुश नोटिफिकेशन',
            'add-title' => 'नोटिफिकेशन जोड़ें',
            'general' => 'सामान्य',

            'id' => 'आईडी',
            'image' => 'तस्वीर',
            'text-title' => 'शीर्षक',
            'edit-notification' => 'नोटिफिकेशन संपादित करें',
            'manage' => 'नोटिफिकेशन',
            'new-notification' => 'नया नोटिफिकेशन',
            'create-btn-title' => 'नोटिफिकेशन सहेजें',
            'notification-image' => 'नोटिफिकेशन छवि',
            'notification-title' => 'नोटिफिकेशन शीर्षक',
            'notification-content' => 'नोटिफिकेशन सामग्री',
            'notification-type' => 'नोटिफिकेशन प्रकार',
            'product-cat-id' => 'उत्पाद / श्रेणी आईडी',
            'store-view' => 'चैनल्स',
            'notification-status' => 'नोटिफिकेशन स्थिति',
            'created' => 'बनाया गया',
            'modified' => 'संशोधित',
            'collection-autocomplete' => 'कस्टम संग्रह - (ऑटोकम्प्लीट)',
            'no-collection-found' => 'सामान्य नाम के साथ कोई संग्रह नहीं मिला।',
            'collection-search-hint' => 'संग्रह का नाम टाइप करना शुरू करें',
            'Action' => [
                'edit' => 'संपादित करें',
            ],

            'status' => [
                'enabled' => 'सक्रिय',
                'disabled' => 'निष्क्रिय',
            ],

            'notification-type-option' => [
                'select' => '-- चयन करें --',
                'simple' => 'साधारण प्रकार',
                'product' => 'उत्पाद आधारित',
                'category' => 'श्रेणी आधारित',
            ],
        ],

        'alert' => [
            'create-success' => ':name को सफलतापूर्वक बनाया गया',
            'update-success' => ':name को सफलतापूर्वक अपडेट किया गया',
            'delete-success' => ':name को सफलतापूर्वक हटा दिया गया',
            'delete-failed' => ':name को हटाने में विफल रहा',
            'sended-successfully' => ':name को एंड्रॉइड और iOS के लिए सफलतापूर्वक पुश किया गया।',
            'no-value-selected' => 'मौजूदा मूल्य नहीं है',
        ],

        'settings' => [
            'exchange_rates' => [
                'error-invalid-target-currency' => 'चेतावनी: अवैध लक्ष्य मुद्रा प्रदान किया गया।',
                'delete-success' => 'सफलता: विनिमय दर सफलतापूर्वक हटा दी गई।',
            ]
        ],

        'response' => [
            'error-invalid-parameter' => 'चेतावनी: अवैध पैरामीटर प्रदान किया गया।',
            'success-login' => 'सफलता: उपयोगकर्ता सफलतापूर्वक लॉगिन हुआ।',
            'error-login' => 'चेतावनी: व्यवस्थापक उपयोगकर्ता लॉगिन नहीं है।',
            'session-expired' => 'चेतावनी: सत्र समाप्त हो गया है। कृपया अपने खाते में फिर से लॉगिन करें।',
            'invalid-header' => 'चेतावनी: अमान्य हैडर टोकन।',
            'success-logout' => 'सफलता: उपयोगकर्ता सफलतापूर्वक लॉगआउट हुआ।',
            'no-login-user' => 'चेतावनी: कोई लॉगिन उपयोगकर्ता नहीं मिला।',
            'error-customer-group' => 'चेतावनी: आप व्यवस्था द्वारा बनाई गई विशेषता समूह को हटाने की अनुमति नहीं है।',
            'password-invalid' => 'चेतावनी: कृपया सही पासवर्ड दर्ज करें।',
            'password-match' => 'चेतावनी: पासवर्ड मेल नहीं खाता।',
            'success-registered' => 'सफलता: उपयोगकर्ता सफलतापूर्वक बनाया गया।',
            'cancel-error' => 'ऑर्डर को रद्द नहीं किया जा सकता।',
            'creation-error' => 'इस आदेश के लिए रिफंड नहीं बनाया जा सकता।',
            'channel-failure' => 'चैनल नहीं मिला।',
            'script-delete-success' => 'स्क्रिप्ट सफलतापूर्वक हटा दिया गया।',
        ],
    ],

    'shop' => [
        'customer' => [
            'success-login' => 'सफलता: ग्राहक सफलतापूर्वक लॉगिन हुआ।',
            'success-logout' => 'सफलता: ग्राहक सफलतापूर्वक लॉगआउट हुआ।',
            'no-login-customer' => 'चेतावनी: कोई लॉगिन ग्राहक नहीं मिला।',
            'address-list' => 'सफलता: ग्राहक का पता विवरण प्राप्त किया गया',
            'not-authorized' => 'चेतावनी: आप इस पते को अपडेट करने की अनुमति नहीं हैं।',
            'success-address-list' => 'सफलता: ग्राहक के पते सफलतापूर्वक प्राप्त हुए।',
            'no-address-list' => 'चेतावनी: कोई ग्राहक का पता नहीं मिला।',
            'text-password' => 'आपका पासवर्ड है: :password',
            'not-exists' => 'चेतावनी: दिए गए डेटा के लिए कोई ग्राहक नहीं मिला।',
        ],
        'response' => [
            'error-registration' => 'चेतावनी: ग्राहक पंजीकरण असफल हुआ।',
            'password-reset-failed' => 'चेतावनी: हम पहले से ही आपको पासवर्ड रीसेट ईमेल भेज चुके हैं, कुछ समय बाद कोशिश करें।',
            'customer-details' => 'सफलता: ग्राहक विवरण सफलतापूर्वक प्राप्त हुए।',
            'not-found' => 'चेतावनी: कोई :name नहीं मिला।',
            'no-address-found' => 'चेतावनी: कोई पता नहीं मिला।',
            'no-order-found' => 'चेतावनी: कोई आदेश नहीं मिला।',
            'warning-empty-cart' => 'चेतावनी: कार्ट में कोई उत्पाद जोड़ा नहीं गया है।',
            'success-add-to-cart' => 'सफलता: उत्पाद को कार्ट में सफलतापूर्वक जोड़ा गया।',
            'success-update-to-cart' => 'सफलता: कार्ट आइटम सफलतापूर्वक अपडेट किया गया।',
            'success-delete-cart-item' => 'सफलता: कार्ट आइटम सफलतापूर्वक हटा दिया गया।',
            'success-moved-cart-item' => 'सफलता: कार्ट आइटम सफलतापूर्वक विश्वित सूची में स्थानांतरित किया गया।',
            'billing-address-missing' => 'चेतावनी: चेकआउट के लिए बिलिंग पता गायब है।',
            'shipping-address-missing' => 'चेतावनी: चेकआउट के लिए शिपिंग पता गायब है।',
            'invalid-address' => 'चेतावनी: दिए गए पते आईडी के लिए कोई पता नहीं मिला।',
            'wrong-error' => 'चेतावनी: आपके कार्ट में कुछ त्रुटि है, पुनः प्रयास करें।',
            'save-cart-address' => 'सफलता: कार्ट पता सफलतापूर्वक सहेजा गया।',
            'error-payment-selection' => 'चेतावनी: भुगतान विधियों को लाने में कुछ त्रुटि है।',
            'selected-shipment' => 'सफलता: शिपमेंट सफलतापूर्वक चयनित हो गया है।',
            'error-payment-save' => 'चेतावनी: भुगतान विधि को सहेजने में कुछ त्रुटि है।',
            'selected-payment' => 'सफलता: भुगतान विधि सफलतापूर्वक चयनित हो गई है।',
            'error-placing-order' => 'चेतावनी: ऑर्डर रखने में कुछ त्रुटि है।',
            'invalid-product' => 'चेतावनी: आप अमान्य उत्पाद के लिए अनुरोध कर रहे हैं।',
            'already-exist-inwishlist' => 'सूचना: यह उत्पाद पहले से ही इच्छा-सूची में मौजूद है।',
            'error-move-to-cart' => 'चेतावनी: इस उत्पाद के कुछ आवश्यक विकल्प हो सकते हैं, कार्ट में नहीं जाने में सक्षम नहीं है।',
            'no-billing-address-found' => 'चेतावनी: बिलिंग आईडी के साथ कोई बिलिंग पता रिकॉर्ड नहीं मिला।',
            'no-shipping-address-found' => 'चेतावनी: शिपिंग आईडी के साथ कोई शिपिंग पता रिकॉर्ड नहीं मिला।',
            'invalid-guest-access' => 'चेतावनी: मेहमान ग्राहकों को बिलिंग / शिपिंग पता आईडी के साथ पता प्राप्त करने की अनुमति नहीं है।',
            'guest-address-warning' => 'चेतावनी: यदि आप मेहमान के रूप में प्रयास कर रहे हैं, तो प्राधिकरण टोकन के बिना कोशिश करें।',
            'warning-num-already-used' => 'चेतावनी: इस :phone नंबर का पहले से ही अलग ईमेल पते का उपयोगकर्ता पंजीकृत है।',
            'coupon-removed' => 'सफलता: कार्ट से कूपन सफलतापूर्वक हटा दिया गया।',
            'coupon-remove-failed' => 'चेतावनी: कूपन को कार्ट से हटाने में कुछ त्रुटि है या कूपन नहीं मिला।',
            'review-create-success' => 'सफलता: समीक्षा सफलतापूर्वक सबमिट की गई है, कृपया अनुमोदन के लिए प्रतीक्षा करें।',
            'un-authorized-access' => 'Warning: You are not authorized to use this section.',
        ],
    ],

    'validation' => [
        'unique' => 'यह :field पहले से ही लिया गया है।',
        'required' => ':field फ़ील्ड आवश्यक है।',
        'same' => ':field और पासवर्ड मिलना चाहिए।',
    ],

    'mail' => [
        'customer' => [
            'password' => [
                'heading' => config('app.name') . ' - पासवर्ड रीसेट',
                'reset' => 'पासवर्ड रीसेट ईमेल',
                'summary' => 'यह आपके खाते के पासवर्ड रीसेट से संबंधित ईमेल है, आपका पासवर्ड सफलतापूर्वक बदल दिया गया है।
                    नीचे दिए गए पासवर्ड का उपयोग करके अपने खाते में लॉगिन करें।',
            ]
        ]
    ]
];