<?php

return [
    'shop' => [
        'subscription' => [
            'already-subscribed' => 'আপনি ইতিমধ্যেই আমাদের নিউজলেটারে সদস্যপদ গ্রহণ করেছেন।',
            'subscribe-success'  => 'আপনি সফলভাবে আমাদের নিউজলেটারে সদস্যপদ গ্রহণ করেছেন।',
        ],

        'contact-us' => [
            'thanks-for-contact' => 'আমাদের সাথে যোগাযোগ করার জন্য ধন্যবাদ। আমরা শীঘ্রই আপনার সাথে যোগাযোগ করব।',
        ],

        'downloadable-products' => [
            'download-sample' => [
                'link-not-found'   => 'সতর্কতা: ডাউনলোড লিঙ্ক পাওয়া যায়নি।',
                'sample-not-found' => 'সতর্কতা: ডাউনলোডযোগ্য নমুনা পাওয়া যায়নি।',
            ],
        ],

        'customers' => [
            'no-login-customer' => 'সতর্কবার্তা: লগইন করা কাস্টমার পাওয়া যায়নি।',
            'success-login'     => 'সাফল্যের সাথে কাস্টমার লগইন হয়েছে।',
            'success-logout'    => 'সাফল্যের সাথে কাস্টমার লগআউট হয়েছে।',

            'signup' => [
                'error-registration' => 'সতর্কবার্তা: কাস্টমার রেজিস্ট্রেশন ব্যর্থ হয়েছে।',
                'success-verify'     => 'অ্যাকাউন্ট সফলভাবে তৈরি হয়েছে, যাচাইকরণের জন্য একটি ইমেল পাঠানো হয়েছে।',
                'success'            => 'সাফল্য: কাস্টমার সফলভাবে নিবন্ধিত এবং লগইন হয়েছে।',
            ],

            'social-login' => [
                'disabled' => 'সতর্কবার্তা: সামাজিক লগইন নিষ্ক্রিয় করা হয়েছে।',
            ],

            'login' => [
                'invalid-creds' => 'দয়া করে আপনার শংসাপত্রগুলি পরীক্ষা করুন এবং আবার চেষ্টা করুন।',
                'not-activated' => 'আপনার সক্রিয়করণের জন্য প্রশাসক অনুমোদন প্রয়োজন',
                'verify-first'  => 'দয়া করে প্রথমে আপনার ইমেল যাচাই করুন।',
                'suspended'     => 'আপনার অ্যাকাউন্টটি প্রশাসক দ্বারা স্থগিত করা হয়েছে।',

                'validation' => [
                    'required' => ':field ক্ষেত্রটি প্রয়োজন।',
                    'same'     => ':field এবং পাসওয়ার্ড মিলতে হবে।',
                    'unique'   => 'এই :field ইতিমধ্যেই নেওয়া হয়েছে।',
                ],
            ],

            'forgot-password' => [
                'already-sent'    => 'আপনার ইমেলে ইতিমধ্যেই পাসওয়ার্ড রিসেট লিঙ্ক পাঠানো হয়েছে।',
                'email-not-exist' => 'ইমেল বিদ্যমান নেই।',
                'reset-link-sent' => 'আপনার ইমেলে পাসওয়ার্ড রিসেট লিঙ্ক পাঠানো হয়েছে।',
            ],

            'account' => [
                'profile' => [
                    'customer-details' => 'সাফল্য: গ্রাহকের বিবরণ সফলভাবে আনা হয়েছে।',
                    'delete-success'   => 'সাফল্য: অ্যাকাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
                    'password-unmatch' => 'পাসওয়ার্ড মেলেনি।',
                    'update-fail'      => 'সতর্কবার্তা: প্রোফাইল আপডেট করা যায়নি।',
                    'update-success'   => 'সাফল্য: প্রোফাইল সফলভাবে আপডেট করা হয়েছে।',
                    'wrong-password'   => 'সতর্কবার্তা: ভুল পাসওয়ার্ড প্রদান করা হয়েছে।',
                    'order-pending'    => 'আপনি অ্যাকাউন্ট মুছতে পারবেন না কারণ আপনার কিছু মুলতুবি অর্ডার রয়েছে।',
                ],

                'addresses' => [
                    'create-success'         => 'ঠিকানা সফলভাবে তৈরি হয়েছে।',
                    'default-update-success' => 'ঠিকানা ডিফল্ট হিসাবে সেট করা হয়েছে',
                    'delete-success'         => 'ঠিকানা সফলভাবে মোছা হয়েছে',
                    'not-found'              => 'সতর্কবার্তা: ঠিকানা পাওয়া যায়নি।',
                    'update-success'         => 'ঠিকানা সফলভাবে আপডেট হয়েছে।',
                    'already-default'        => 'সতর্কবার্তা: এই ঠিকানাটি ইতিমধ্যেই ডিফল্ট হিসাবে সেট করা হয়েছে।',
                ],

                'wishlist' => [
                    'product-removed' => 'সতর্কবার্তা: পণ্য পাওয়া যায়নি।',
                    'success'         => 'সাফল্যের সাথে পণ্যটি উইশলিস্টে যুক্ত হয়েছে।',
                    'already-exist'   => 'সতর্কবার্তা: ইতিমধ্যেই উইশলিস্টে যুক্ত হয়েছে।',
                    'remove-success'  => 'সাফল্যের সাথে আইটেমটি উইশলিস্ট থেকে সরানো হয়েছে।',
                    'not-found'       => 'সতর্কবার্তা: উইশলিস্টে কোনও পণ্য পাওয়া যায়নি।',
                    'moved-to-cart'   => 'সাফল্যের সাথে পণ্যটি কার্টে সরানো হয়েছে।',
                ],

                'orders' => [
                    'not-found'      => 'সতর্কবার্তা: কোনও অর্ডার পাওয়া যায়নি।',
                    'cancel-error'   => 'সতর্কবার্তা: অর্ডার বাতিল হয়নি।',
                    'cancel-success' => 'সাফল্যের সাথে অর্ডার বাতিল হয়েছে।',

                    'shipment' => [
                        'not-found' => 'সতর্কবার্তা: প্রেরণ পাওয়া যায়নি।',
                    ],

                    'invoice' => [
                        'not-found' => 'সতর্কবার্তা: চালান পাওয়া যায়নি।',
                    ],

                    'refund' => [
                        'not-found' => 'সতর্কবার্তা: রিফান্ড পাওয়া যায়নি।',
                    ],
                ],

                'downloadable-products' => [
                    'not-found'      => 'সতর্কবার্তা: ডাউনলোডযোগ্য পণ্য পাওয়া যায়নি।',
                    'not-auth'       => 'সতর্কবার্তা: আপনি এই ক্রিয়াটি সম্পাদন করার অনুমতি পাচ্ছেন না।',
                    'payment-error'  => 'এই ডাউনলোডের জন্য পেমেন্ট করা হয়নি।',
                    'download-error' => 'ডাউনলোড লিঙ্কের মেয়াদ শেষ হয়েছে।',
                ],

                'gdpr' => [
                    'create-success'       => 'সফলতা: GDPR অনুরোধ সফলভাবে তৈরি হয়েছে।',
                    'revoke-failed'        => 'সতর্কতা: GDPR অনুরোধ বাতিল করা যায়নি।',
                    'revoked-successfully' => 'সফলতা: GDPR অনুরোধ সফলভাবে বাতিল হয়েছে।',
                    'not-enabled'          => 'সতর্কবার্তা: GDPR সক্রিয় করা হয়নি।',
                ],
            ],

            'compare-product' => [
                'not-found'           => 'সতর্কতা: তুলনা পণ্য পাওয়া যায়নি।',
                'product-not-found'   => 'সতর্কতা: পণ্য পাওয়া যায়নি।',
                'already-added'       => 'সতর্কতা: পণ্য ইতিমধ্যেই তুলনা তালিকায় যোগ করা হয়েছে।',
                'item-add-success'    => 'সাফল্য: পণ্য সফলভাবে তুলনা তালিকায় যোগ করা হয়েছে।',
                'remove-success'      => 'সাফল্য: আইটেমটি সফলভাবে তুলনা তালিকা থেকে সরানো হয়েছে।',
                'mass-remove-success' => 'সাফল্য: নির্বাচিত আইটেমগুলি সফলভাবে মুছে ফেলা হয়েছে।',
                'not-auth'            => 'সতর্কতা: আপনি এই ক্রিয়াটি সম্পাদন করার অনুমতি পাচ্ছেন না।',
            ],

            'reviews' => [
                'create-success'      => 'সাফল্যের সাথে পর্যালোচনা তৈরি হয়েছে।',
                'delete-success'      => 'সাফল্যের সাথে পর্যালোচনা মোছা হয়েছে।',
                'mass-delete-success' => 'সাফল্যের সাথে নির্বাচিত পর্যালোচনা মোছা হয়েছে।',
                'not-found'           => 'সতর্কবার্তা: পর্যালোচনা পাওয়া যায়নি।',
                'product-not-found'   => 'সতর্কতা: পণ্য পাওয়া যায়নি।',
            ],
        ],

        'checkout' => [
            'cart' => [
                'item' => [
                    'error' => [
                        'downloadable-links' => 'সতর্কবার্তা: ডাউনলোডযোগ্য লিঙ্ক পাওয়া যায়নি।',
                        'invalid-parameter'  => 'সতর্কবার্তা: অবৈধ প্যারামিটার প্রদান করা হয়েছে।',
                    ],

                    'success' => [
                        'add-to-cart'      => 'সাফল্যের সাথে পণ্যটি কার্টে যুক্ত হয়েছে।',
                        'update-to-cart'   => 'সাফল্যের সাথে পণ্যটি কার্টে আপডেট হয়েছে।',
                        'delete-cart-item' => 'সাফল্যের সাথে আইটেমটি কার্ট থেকে সরানো হয়েছে।',
                        'all-remove'       => 'সাফল্যের সাথে সমস্ত আইটেম কার্ট থেকে সরানো হয়েছে।',
                        'move-to-wishlist' => 'সাফল্যের সাথে নির্বাচিত আইটেমগুলি উইশলিস্টে সরানো হয়েছে।',
                    ],

                    'fail' => [
                        'all-remove'       => 'সতর্কবার্তা: সমস্ত আইটেম কার্ট থেকে সরানো হয়নি।',
                        'update-to-cart'   => 'সতর্কবার্তা: পণ্যটি কার্টে আপডেট হয়নি।',
                        'delete-cart-item' => 'সতর্কবার্তা: আইটেমটি কার্ট থেকে সরানো হয়নি।',
                        'not-found'        => 'সতর্কবার্তা: কার্ট পাওয়া যায়নি।',
                        'item-not-found'   => 'সতর্কবার্তা: আইটেম পাওয়া যায়নি।',
                        'move-to-wishlist' => 'সতর্কবার্তা: নির্বাচিত আইটেমগুলি উইশলিস্টে সরানো হয়নি।',
                    ],
                ],
            ],

            'addresses' => [
                'guest-address-warning'     => 'সতর্কবার্তা: অতিথি ব্যবহারকারী ঠিকানা যুক্ত করতে পারেন না।',
                'guest-checkout-warning'    => 'সতর্কবার্তা: অতিথি ব্যবহারকারী চেকআউট করতে পারেন না।',
                'no-billing-address-found'  => 'সতর্কবার্তা: কোনও বিলিং ঠিকানা পাওয়া যায়নি।',
                'no-shipping-address-found' => 'সতর্কবার্তা: কোনও শিপিং ঠিকানা পাওয়া যায়নি।',
                'address-save-success'      => 'সাফল্যের সাথে ঠিকানা সংরক্ষণ করা হয়েছে।',
            ],

            'shipping' => [
                'method-not-found' => 'সতর্কবার্তা: শিপিং পদ্ধতি পাওয়া যায়নি।',
                'method-fetched'   => 'সাফল্যের সাথে শিপিং পদ্ধতি পেয়েছেন।',
                'save-failed'      => 'সতর্কবার্তা: শিপিং পদ্ধতি সংরক্ষণ করা হয়নি।',
                'save-success'     => 'সাফল্যের সাথে শিপিং পদ্ধতি সংরক্ষণ করা হয়েছে।',
            ],

            'payment' => [
                'method-not-found' => 'সতর্কবার্তা: পেমেন্ট পদ্ধতি পাওয়া যায়নি।',
                'method-fetched'   => 'সাফল্যের সাথে পেমেন্ট পদ্ধতি পেয়েছেন।',
                'save-failed'      => 'সতর্কবার্তা: পেমেন্ট পদ্ধতি সংরক্ষণ করা হয়নি।',
                'save-success'     => 'সাফল্যের সাথে পেমেন্ট পদ্ধতি সংরক্ষণ করা হয়েছে।',
            ],

            'coupon' => [
                'apply-success'   => 'সাফল্যের সাথে কুপন কোড প্রয়োগ করা হয়েছে।',
                'already-applied' => 'সতর্কবার্তা: কুপন কোড ইতিমধ্যেই প্রয়োগ করা হয়েছে।',
                'invalid-code'    => 'সতর্কবার্তা: অবৈধ কুপন কোড।',
                'remove-success'  => 'সাফল্যের সাথে কুপন কোড সরানো হয়েছে।',
                'remove-failed'   => 'সতর্কবার্তা: কুপন কোড সরানো হয়নি।',
            ],

            'something-wrong'          => 'সতর্কবার্তা: কিছু ভুল হয়েছে।',
            'invalid-guest-user'       => 'সতর্কবার্তা: অবৈধ অতিথি ব্যবহারকারী।',
            'empty-cart'               => 'সতর্কবার্তা: কার্ট খালি।',
            'missing-billing-address'  => 'সতর্কবার্তা: বিলিং ঠিকানা অনুপস্থিত।',
            'missing-shipping-address' => 'সতর্কবার্তা: শিপিং ঠিকানা অনুপস্থিত।',
            'missing-shipping-method'  => 'সতর্কবার্তা: শিপিং পদ্ধতি অনুপস্থিত।',
            'missing-payment-method'   => 'সতর্কবার্তা: পেমেন্ট পদ্ধতি অনুপস্থিত।',
            'no-address-found'         => 'সতর্কবার্তা: কোনও বিলিং এবং শিপিং ঠিকানা পাওয়া যায়নি।',
        ],
    ],

    'admin' => [
        'acl' => [
            'create'            => 'তৈরি করুন',
            'delete'            => 'মুছুন',
            'edit'              => 'সম্পাদনা করুন',
            'mass-delete'       => 'সমস্ত মুছুন',
            'mass-update'       => 'সমস্ত আপডেট করুন',
            'push-notification' => 'পুশ বিজ্ঞপ্তি',
            'send'              => 'পাঠান',
        ],

        'components' => [
            'layouts' => [
                'sidebar' => [
                    'push-notification' => 'পুশ বিজ্ঞপ্তি',
                ],
            ],
        ],

        'configuration' => [
            'index' => [
                'general' => [
                    'graphql-api' => [
                        'notification-topic'              => 'বিজ্ঞপ্তি বিষয়',
                        'info'                            => 'বিজ্ঞপ্তি সম্পর্কিত কনফিগারেশন',
                        'push-notification-configuration' => 'FCM পুশ বিজ্ঞপ্তি কনফিগারেশন',
                        'title'                           => 'GraphQL API',
                        'private-key'                     => 'প্রাইভেট কি JSON ফাইল কন্টেন্ট',
                        'info-get-private-key'            => 'তথ্য: FCM প্রাইভেট কি JSON ফাইল কন্টেন্ট পেতে: <a href="https://console.firebase.google.com/" target="_blank">এখানে ক্লিক করুন</a>',
                    ],

                    'content' => [
                        'custom-script' => [
                            'update-success' => 'সফলতা: কাস্টম স্ক্রিপ্ট সফলভাবে আপডেট হয়েছে।',
                        ],
                    ],
                ],
            ],
        ],

        'sales' => [
            'orders' => [
                'cancel-error'   => 'সতর্কবার্তা: অর্ডারটি বাতিল করা যায়নি।',
                'cancel-success' => 'সাফল্য: অর্ডারটি সফলভাবে বাতিল করা হয়েছে।',
                'not-found'      => 'সতর্কবার্তা: অর্ডারটি পাওয়া যায়নি।',
            ],

            'shipments' => [
                'creation-error'   => 'সতর্কবার্তা: প্রেরণ তৈরি করা যায়নি।',
                'not-found'        => 'সতর্কবার্তা: প্রেরণটি পাওয়া যায়নি।',
                'quantity-invalid' => 'সতর্কবার্তা: অবৈধ পরিমাণ প্রদান করা হয়েছে।',
                'shipment-error'   => 'সতর্কবার্তা: প্রেরণ তৈরি করা যায়নি।',
                'create-success'   => 'সাফল্য: প্রেরণটি সফলভাবে তৈরি হয়েছে।',
            ],

            'invoices' => [
                'creation-error' => 'সতর্কবার্তা: চালানটি তৈরি করা যায়নি।',
                'not-found'      => 'সতর্কবার্তা: চালানটি পাওয়া যায়নি।',
                'product-error'  => 'সতর্কবার্তা: অবৈধ পণ্য প্রদান করা হয়েছে।',
                'create-success' => 'সাফল্য: চালানটি সফলভাবে তৈরি হয়েছে।',
                'invalid-qty'    => 'সতর্কবার্তা: চালানের আইটেমগুলির জন্য একটি অবৈধ পরিমাণ পাওয়া গেছে।',
            ],

            'refunds' => [
                'creation-error'      => 'সতর্কবার্তা: ফেরত তৈরি করা যায়নি।',
                'refund-amount-error' => 'সতর্কবার্তা: অবৈধ ফেরত পরিমাণ প্রদান করা হয়েছে।',
                'refund-limit-error'  => 'সতর্কবার্তা: ফেরত পরিমাণটি :amount এর সীমা অতিক্রম করেছে',
                'not-found'           => 'সতর্কবার্তা: ফেরত পাওয়া যায়নি।',
                'create-success'      => 'সাফল্য: ফেরত সফলভাবে তৈরি হয়েছে।',
            ],

            'transactions' => [
                'already-paid'   => 'সতর্কবার্তা: চালানটি ইতিমধ্যে পরিশোধ করা হয়েছে।',
                'amount-exceed'  => 'সতর্কবার্তা: লেনদেন পরিমাণটি সীমা অতিক্রম করেছে।',
                'zero-amount'    => 'সতর্কবার্তা: লেনদেন পরিমাণটি শূন্যের চেয়ে বেশি হওয়া উচিত।',
                'create-success' => 'সাফল্য: লেনদেনটি সফলভাবে তৈরি হয়েছে।',
            ],

            'reorder' => [
                'customer-not-found'       => 'সতর্কবার্তা: গ্রাহক পাওয়া যায়নি।',
                'cart-not-found'           => 'সতর্কবার্তা: কার্টটি পাওয়া যায়নি।',
                'cart-item-not-found'      => 'সতর্কবার্তা: কার্ট আইটেমটি পাওয়া যায়নি।',
                'cart-create-success'      => 'সাফল্য: কার্টটি সফলভাবে তৈরি হয়েছে।',
                'cart-item-add-success'    => 'সাফল্য: পণ্যটি কার্টে সফলভাবে যুক্ত হয়েছে।',
                'cart-item-remove-success' => 'সাফল্য: আইটেমটি কার্ট থেকে সফলভাবে সরানো হয়েছে।',
                'cart-item-update-success' => 'সাফল্য: পণ্যটি কার্টে সফলভাবে আপডেট হয়েছে।',
                'something-wrong'          => 'সতর্কবার্তা: কিছু ভুল হয়েছে।',
                'address-save-success'     => 'সাফল্য: ঠিকানা সফলভাবে সংরক্ষিত হয়েছে।',
                'shipping-save-success'    => 'সাফল্য: পরিবহন পদ্ধতি সফলভাবে সংরক্ষিত হয়েছে।',
                'payment-save-success'     => 'সাফল্য: পেমেন্ট পদ্ধতি সফলভাবে সংরক্ষিত হয়েছে।',
                'order-placed-success'     => 'সাফল্য: অর্ডারটি সফলভাবে প্রদান হয়েছে।',
                'payment-method-not-found' => 'সতর্কবার্তা: পেমেন্ট পদ্ধতি পাওয়া যায়নি।',
                'minimum-order-amount-err' => 'সতর্কবার্তা: সর্বনিম্ন অর্ডার পরিমাণ হওয়া উচিত :amount',
                'check-shipping-address'   => 'সতর্কবার্তা: পরিবহনের ঠিকানা পরীক্ষা করুন।',
                'check-billing-address'    => 'সতর্কবার্তা: বিলিং ঠিকানা পরীক্ষা করুন।',
                'specify-shipping-method'  => 'সতর্কবার্তা: পরিবহন পদ্ধতি নির্দিষ্ট করুন।',
                'specify-payment-method'   => 'সতর্কবার্তা: পেমেন্ট পদ্ধতি নির্দিষ্ট করুন।',
                'coupon-not-valid'         => 'সতর্কবার্তা: কুপন কোডটি বৈধ নয়।',
                'coupon-already-applied'   => 'সতর্কবার্তা: কুপন কোডটি ইতিমধ্যে প্রয়োগ করা হয়েছে।',
                'coupon-applied'           => 'সাফল্য: কুপন কোডটি সফলভাবে প্রয়োগ করা হয়েছে।',
                'coupon-removed'           => 'সাফল্য: কুপন কোডটি সফলভাবে সরানো হয়েছে।',
            ],
        ],

        'catalog' => [
            'products' => [
                'create-success'            => 'পণ্যটি সফলভাবে তৈরি হয়েছে।',
                'delete-success'            => 'পণ্যটি সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'                 => 'সতর্কবার্তা: পণ্যটি পাওয়া যায়নি।',
                'update-success'            => 'পণ্যটি সফলভাবে আপডেট হয়েছে।',
                'configurable-attr-missing' => 'সতর্কবার্তা: কনফিগারেবল গুণমান অনুপস্থিত।',
                'simple-products-error'     => 'সতর্কবার্তা: সিম্পল পণ্যগুলি অনুপস্থিত।',
            ],

            'categories' => [
                'already-taken'  => 'সতর্কবার্তা: স্লাগটি ইতিমধ্যে নেওয়া হয়েছে।',
                'create-success' => 'ক্যাটাগরি সফলভাবে তৈরি হয়েছে।',
                'delete-success' => 'ক্যাটাগরি সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'      => 'সতর্কবার্তা: ক্যাটাগরি পাওয়া যায়নি।',
                'update-success' => 'ক্যাটাগরি সফলভাবে আপডেট হয়েছে।',
                'root-delete'    => 'সতর্কবার্তা: মূল ক্যাটাগরি মুছে ফেলা যায় না।',
            ],

            'attributes' => [
                'create-success'    => 'গুণমান সফলভাবে তৈরি হয়েছে।',
                'delete-success'    => 'গুণমান সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'         => 'সতর্কবার্তা: গুণমান পাওয়া যায়নি।',
                'update-success'    => 'গুণমান সফলভাবে আপডেট হয়েছে।',
                'user-define-error' => 'সতর্কবার্তা: আপনি সিস্টেম-তৈরি গুণমান মুছে ফেলতে অনুমোদিত নন।',
            ],

            'attribute-groups' => [
                'create-success'    => 'গুণমান গ্রুপ সফলভাবে তৈরি হয়েছে।',
                'delete-success'    => 'গুণমান গ্রুপ সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'         => 'সতর্কবার্তা: গুণমান গ্রুপ পাওয়া যায়নি।',
                'update-success'    => 'গুণমান গ্রুপ সফলভাবে আপডেট হয়েছে।',
                'user-define-error' => 'সতর্কবার্তা: আপনি সিস্টেম-তৈরি গুণমান গ্রুপ মুছে ফেলতে অনুমোদিত নন।',
            ],

            'attribute-families' => [
                'create-success'          => 'গুণমান পরিবার সফলভাবে তৈরি হয়েছে।',
                'delete-success'          => 'গুণমান পরিবার সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'               => 'সতর্কবার্তা: গুণমান পরিবার পাওয়া যায়নি।',
                'update-success'          => 'গুণমান পরিবার সফলভাবে আপডেট হয়েছে।',
                'last-delete-error'       => 'সতর্কবার্তা: শেষ গুণমান পরিবার মুছে ফেলা যায় না।',
                'attribute-product-error' => 'সতর্কবার্তা: কিছু পণ্য এই গুণমান পরিবারের সাথে সংযুক্ত।',
                'user-define-error'       => 'সতর্কবার্তা: আপনি সিস্টেম-তৈরি গুণমান পরিবার মুছে ফেলতে অনুমোদিত নন।',
            ],
        ],

        'customers' => [
            'customers' => [
                'create-success'       => 'গ্রাহক সফলভাবে তৈরি হয়েছে।',
                'delete-order-pending' => 'অর্ডার সম্পন্ন বা প্রক্রিয়াধীন অবস্থায় কিছু অর্ডার থাকার কারণে গ্রাহকের অ্যাকাউন্ট মুছে ফেলা যায় না।',
                'delete-success'       => 'গ্রাহক সফলভাবে মুছে ফেলা হয়েছে',
                'not-found'            => 'সতর্কবার্তা: গ্রাহক পাওয়া যায়নি।',
                'note-created-success' => 'নোট সফলভাবে তৈরি হয়েছে',
                'update-success'       => 'গ্রাহক সফলভাবে আপডেট হয়েছে।',
                'login-success'        => 'গ্রাহক সফলভাবে লগইন হয়েছে।',
            ],

            'addresses' => [
                'create-success'         => 'গ্রাহকের ঠিকানা সফলভাবে তৈরি হয়েছে।',
                'default-update-success' => 'ঠিকানা ডিফল্ট হিসাবে সেট করা হয়েছে।',
                'delete-success'         => 'গ্রাহকের ঠিকানা সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'              => 'সতর্কবার্তা: গ্রাহকের ঠিকানা পাওয়া যায়নি।',
                'update-success'         => 'গ্রাহকের ঠিকানা সফলভাবে আপডেট হয়েছে।',
                'already-default'        => 'সতর্কবার্তা: এই ঠিকানাটি ইতিমধ্যেই ডিফল্ট হিসাবে সেট করা হয়েছে।',
            ],

            'groups' => [
                'create-success'     => 'গ্রাহক গ্রুপ সফলভাবে তৈরি হয়েছে।',
                'customer-associate' => 'সতর্কবার্তা: গ্রুপটি মুছে ফেলা যায় না। গ্রাহক এর সাথে সংযুক্ত।',
                'delete-success'     => 'গ্রাহক গ্রুপ সফলভাবে মুছে ফেলা হয়েছে',
                'not-found'          => 'সতর্কবার্তা: গ্রাহক গ্রুপ পাওয়া যায়নি।',
                'update-success'     => 'গ্রাহক গ্রুপ সফলভাবে আপডেট হয়েছে।',
                'user-define-error'  => 'সতর্কবার্তা: আপনি সিস্টেম-তৈরি গ্রাহক গ্রুপ মুছে ফেলতে অনুমোদিত নন।',
            ],

            'reviews' => [
                'delete-success' => 'রিভিউ সফলভাবে মুছে ফেলা হয়েছে',
                'not-found'      => 'সতর্কবার্তা: রিভিউ পাওয়া যায়নি।',
                'update-success' => 'রিভিউ সফলভাবে আপডেট হয়েছে।',
            ],

            'gdpr' => [
                'delete-success' => 'সাফল্য: GDPR অনুরোধ সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'      => 'সতর্কতা: GDPR অনুরোধ খুঁজে পাওয়া যায়নি।',
                'update-success' => 'GDPR অনুরোধ সফলভাবে আপডেট হয়েছে।',
            ],
        ],

        'cms' => [
            'already-taken'  => 'সতর্কবার্তা: স্লাগটি ইতিমধ্যে নেওয়া হয়েছে।',
            'create-success' => 'সিএমএস সফলভাবে তৈরি হয়েছে।',
            'delete-success' => 'সিএমএস সফলভাবে মুছে ফেলা হয়েছে',
            'not-found'      => 'সতর্কবার্তা: সিএমএস পাওয়া যায়নি।',
            'update-success' => 'সিএমএস সফলভাবে আপডেট হয়েছে।',
        ],

        'marketing' => [
            'promotions' => [
                'catalog-rules' => [
                    'create-success' => 'ক্যাটালগ নিয়ম সফলভাবে তৈরি হয়েছে।',
                    'delete-failed'  => 'সতর্কবার্তা: ক্যাটালগ নিয়ম মুছে ফেলা যায়নি।',
                    'delete-success' => 'ক্যাটালগ নিয়ম সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: ক্যাটালগ নিয়ম পাওয়া যায়নি।',
                    'update-success' => 'ক্যাটালগ নিয়ম সফলভাবে আপডেট হয়েছে।',
                ],

                'cart-rules' => [
                    'create-success' => 'কার্ট নিয়ম সফলভাবে তৈরি হয়েছে।',
                    'delete-failed'  => 'সতর্কবার্তা: কার্ট নিয়ম মুছে ফেলা যায়নি।',
                    'delete-success' => 'কার্ট নিয়ম সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: কার্ট নিয়ম পাওয়া যায়নি।',
                    'update-success' => 'কার্ট নিয়ম সফলভাবে আপডেট হয়েছে।',
                ],
            ],

            'communications' => [
                'email-templates' => [
                    'create-success' => 'ইমেল টেমপ্লেট সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'ইমেল টেমপ্লেট সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: ইমেল টেমপ্লেট পাওয়া যায়নি।',
                    'update-success' => 'ইমেল টেমপ্লেট সফলভাবে আপডেট হয়েছে।',
                ],

                'events' => [
                    'create-success' => 'ইভেন্ট সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'ইভেন্ট সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: ইভেন্ট পাওয়া যায়নি।',
                    'update-success' => 'ইভেন্ট সফলভাবে আপডেট হয়েছে।',
                ],

                'campaigns' => [
                    'create-success' => 'ক্যাম্পেইন সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'ক্যাম্পেইন সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: ক্যাম্পেইন পাওয়া যায়নি।',
                    'update-success' => 'ক্যাম্পেইন সফলভাবে আপডেট হয়েছে।',
                ],

                'subscriptions' => [
                    'delete-success'      => 'সাবস্ক্রিপশন সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'           => 'সতর্কবার্তা: সাবস্ক্রিপশন পাওয়া যায়নি।',
                    'unsubscribe-success' => 'সাফল্য: সাবস্ক্রিপশন সফলভাবে অনসাবস্ক্রাইব করা হয়েছে।',
                ],
            ],

            'seo' => [
                'url-rewrites' => [
                    'create-success' => 'URL পুনরায় লিখিত সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'URL পুনরায় লিখিত সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: URL পুনরায় লিখিত পাওয়া যায়নি।',
                    'update-success' => 'URL পুনরায় লিখিত সফলভাবে আপডেট হয়েছে।',
                ],

                'search-terms' => [
                    'create-success' => 'অনুসন্ধান শব্দ সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'অনুসন্ধান শব্দ সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: অনুসন্ধান শব্দ পাওয়া যায়নি।',
                    'update-success' => 'অনুসন্ধান শব্দ সফলভাবে আপডেট হয়েছে।',
                ],

                'search-synonyms' => [
                    'create-success' => 'অনুসন্ধান সমার্থক শব্দ সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'অনুসন্ধান সমার্থক শব্দ সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: অনুসন্ধান সমার্থক শব্দ পাওয়া যায়নি।',
                    'update-success' => 'অনুসন্ধান সমার্থক শব্দ সফলভাবে আপডেট হয়েছে।',
                ],

                'sitemaps' => [
                    'create-success' => 'সাইটম্যাপ সফলভাবে তৈরি হয়েছে।',
                    'delete-success' => 'সাইটম্যাপ সফলভাবে মুছে ফেলা হয়েছে।',
                    'not-found'      => 'সতর্কবার্তা: সাইটম্যাপ পাওয়া যায়নি।',
                    'update-success' => 'সাইটম্যাপ সফলভাবে আপডেট হয়েছে।',
                ],
            ],
        ],

        'settings' => [
            'locales' => [
                'create-success'       => 'লোকেল সফলভাবে তৈরি হয়েছে।',
                'default-delete-error' => 'ডিফল্ট লোকেল মুছে ফেলা যায় না।',
                'delete-error'         => 'লোকেল মুছে ফেলা যায়নি।',
                'delete-success'       => 'লোকেল সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error'    => 'শেষ লোকেল মুছে ফেলা যায় না।',
                'not-found'            => 'সতর্কবার্তা: লোকেল পাওয়া যায়নি।',
                'update-success'       => 'লোকেল সফলভাবে আপডেট হয়েছে।',
            ],

            'currencies' => [
                'create-success'       => 'মুদ্রা সফলভাবে তৈরি হয়েছে।',
                'default-delete-error' => 'ডিফল্ট মুদ্রা মুছে ফেলা যায় না।',
                'delete-error'         => 'মুদ্রা মুছে ফেলা যায়নি।',
                'delete-success'       => 'মুদ্রা সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error'    => 'শেষ মুদ্রা মুছে ফেলা যায় না।',
                'not-found'            => 'সতর্কবার্তা: মুদ্রা পাওয়া যায়নি।',
                'update-success'       => 'মুদ্রা সফলভাবে আপডেট হয়েছে।',
            ],

            'exchange-rates' => [
                'create-success'          => 'বিনিময় হার সফলভাবে তৈরি হয়েছে।',
                'delete-error'            => 'বিনিময় হার মুছে ফেলা যায়নি।',
                'delete-success'          => 'বিনিময় হার সফলভাবে মুছে ফেলা হয়েছে।',
                'invalid-target-currency' => 'সতর্কবার্তা: অবৈধ লক্ষ্য মুদ্রা প্রদান করা হয়েছে।',
                'last-delete-error'       => 'শেষ বিনিময় হার মুছে ফেলা যায় না।',
                'not-found'               => 'সতর্কবার্তা: বিনিময় হার পাওয়া যায়নি।',
                'update-success'          => 'বিনিময় হার সফলভাবে আপডেট হয়েছে।',
            ],

            'inventory-sources' => [
                'create-success'    => 'ইনভেন্টরি সফলভাবে তৈরি হয়েছে।',
                'delete-error'      => 'ইনভেন্টরি মুছে ফেলা যায়নি।',
                'delete-success'    => 'ইনভেন্টরি সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error' => 'শেষ ইনভেন্টরি মুছে ফেলা যায় না।',
                'not-found'         => 'সতর্কবার্তা: ইনভেন্টরি পাওয়া যায়নি।',
                'update-success'    => 'ইনভেন্টরি সফলভাবে আপডেট হয়েছে।',
            ],

            'channels' => [
                'create-success'       => 'চ্যানেল সফলভাবে তৈরি হয়েছে।',
                'default-delete-error' => 'ডিফল্ট চ্যানেল মুছে ফেলা যায় না।',
                'delete-error'         => 'চ্যানেল মুছে ফেলা যায়নি।',
                'delete-success'       => 'চ্যানেল সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error'    => 'শেষ চ্যানেল মুছে ফেলা যায় না।',
                'not-found'            => 'সতর্কবার্তা: চ্যানেল পাওয়া যায়নি।',
                'update-success'       => 'চ্যানেল সফলভাবে আপডেট হয়েছে।',
            ],

            'users' => [
                'activate-warning'  => 'আপনার অ্যাকাউন্টটি এখনও সক্রিয় হয়নি, দয়া করে প্রশাসকের সাথে যোগাযোগ করুন।',
                'create-success'    => 'ব্যবহারকারী সফলভাবে তৈরি হয়েছে।',
                'delete-error'      => 'ব্যবহারকারী মুছে ফেলা যায়নি।',
                'delete-success'    => 'ব্যবহারকারী সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error' => 'শেষ ব্যবহারকারী মুছে ফেলা যায় না।',
                'login-error'       => 'দয়া করে আপনার পরিচয়পত্র পরীক্ষা করুন এবং আবার চেষ্টা করুন।',
                'not-found'         => 'সতর্কবার্তা: ব্যবহারকারী পাওয়া যায়নি।',
                'success-login'     => 'সাফল্য: ব্যবহারকারী সফলভাবে লগইন হয়েছে।',
                'success-logout'    => 'সাফল্য: ব্যবহারকারী সফলভাবে লগআউট হয়েছে।',
                'update-success'    => 'ব্যবহারকারী সফলভাবে আপডেট হয়েছে।',
            ],

            'roles' => [
                'create-success'    => 'ভূমিকা সফলভাবে তৈরি হয়েছে।',
                'delete-error'      => 'ভূমিকা মুছে ফেলা যায়নি।',
                'delete-success'    => 'ভূমিকা সফলভাবে মুছে ফেলা হয়েছে।',
                'last-delete-error' => 'শেষ ভূমিকা মুছে ফেলা যায় না।',
                'not-found'         => 'সতর্কবার্তা: ভূমিকা পাওয়া যায়নি।',
                'update-success'    => 'ভূমিকা সফলভাবে আপডেট হয়েছে।',
            ],

            'themes' => [
                'create-success' => 'থিম সফলভাবে তৈরি হয়েছে।',
                'delete-success' => 'থিম সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'      => 'সতর্কবার্তা: থিম পাওয়া যায়নি।',
                'update-success' => 'থিম সফলভাবে আপডেট হয়েছে।',

                'validation' => [
                    'filter-input' => [
                        'category-not-exist'    => 'নির্দিষ্ট category_id বিদ্যমান নেই।',
                        'invalid-boolean-value' => ':key এর মান অবশ্যই 0 অথবা 1 হতে হবে।',
                        'invalid-filter-key'    => 'ফিল্টার কী ":key" অনুমোদিত নয়।',
                        'invalid-limit-value'   => 'limit এর মান অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি হতে হবে: :options।',
                        'invalid-select-option' => ':key এর মান অবৈধ। বৈধ বিকল্পগুলি হল: :options।',
                        'invalid-sort-value'    => 'sort এর মান অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি হতে হবে: :options।',
                        'missing-limit-key'     => 'filtersInput-এ "limit" কী থাকা আবশ্যক।',
                        'missing-sort-key'      => 'filtersInput-এ "sort" কী থাকা আবশ্যক।',
                    ],
                ],
            ],

            'tax-rates' => [
                'create-success' => 'করের হার সফলভাবে তৈরি হয়েছে।',
                'delete-error'   => 'করের হার মুছে ফেলা যায়নি।',
                'delete-success' => 'করের হার সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'      => 'সতর্কবার্তা: করের হার পাওয়া যায়নি।',
                'update-success' => 'করের হার সফলভাবে আপডেট হয়েছে।',
            ],

            'tax-category' => [
                'create-success'     => 'কর বিভাগ সফলভাবে তৈরি হয়েছে।',
                'delete-error'       => 'কর বিভাগ মুছে ফেলা যায়নি।',
                'delete-success'     => 'কর বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
                'not-found'          => 'সতর্কবার্তা: কর বিভাগ পাওয়া যায়নি।',
                'tax-rate-not-found' => 'দেওয়া আইডিগুলি পাওয়া যায়নি। আইডিসমূহ: - :ids',
                'update-success'     => 'কর বিভাগ সফলভাবে আপডেট হয়েছে।',
            ],

            'notification' => [
                'index' => [
                    'add-title' => 'নোটিফিকেশন যুক্ত করুন',
                    'general'   => 'সাধারণ',
                    'title'     => 'পুশ বিজ্ঞপ্তি',

                    'datagrid' => [
                        'channel-name'         => 'চ্যানেলের নাম',
                        'created-at'           => 'তৈরির সময়',
                        'delete'               => 'মুছে ফেলুন',
                        'id'                   => 'আইডি',
                        'image'                => 'চিত্র',
                        'notification-content' => 'নোটিফিকেশনের বিষয়বস্তু',
                        'notification-status'  => 'নোটিফিকেশনের অবস্থা',
                        'notification-type'    => 'নোটিফিকেশনের ধরণ',
                        'text-title'           => 'শিরোনাম',
                        'update'               => 'আপডেট',
                        'updated-at'           => 'আপডেটের সময়',

                        'status' => [
                            'disabled' => 'নিষ্ক্রিয়',
                            'enabled'  => 'সক্রিয়',
                        ],
                    ],
                ],

                'create' => [
                    'back-btn'             => 'পিছনে',
                    'content-and-image'    => 'নোটিফিকেশনের বিষয়বস্তু এবং চিত্র',
                    'create-btn-title'     => 'নোটিফিকেশন সংরক্ষণ করুন',
                    'general'              => 'সাধারণ',
                    'image'                => 'চিত্র',
                    'new-notification'     => 'নতুন নোটিফিকেশন',
                    'notification-content' => 'নোটিফিকেশনের বিষয়বস্তু',
                    'notification-type'    => 'নোটিফিকেশনের ধরণ',
                    'product-cat-id'       => 'পণ্য/বিভাগ আইডি',
                    'settings'             => 'সেটিংস',
                    'status'               => 'স্থিতি',
                    'store-view'           => 'চ্যানেলস',
                    'title'                => 'পুশ নোটিফিকেশন',

                    'option-type' => [
                        'category' => 'বিভাগ',
                        'others'   => 'সাধারণ',
                        'product'  => 'পণ্য',
                    ],
                ],

                'edit' => [
                    'back-btn'             => 'পিছনে',
                    'content-and-image'    => 'নোটিফিকেশনের বিষয়বস্তু এবং চিত্র',
                    'edit-notification'    => 'নোটিফিকেশন সম্পাদনা করুন',
                    'general'              => 'সাধারণ',
                    'image'                => 'চিত্র',
                    'notification-content' => 'নোটিফিকেশনের বিষয়বস্তু',
                    'notification-type'    => 'নোটিফিকেশনের ধরণ',
                    'product-cat-id'       => 'পণ্য/বিভাগ আইডি',
                    'send-title'           => 'নোটিফিকেশন পাঠান',
                    'settings'             => 'সেটিংস',
                    'status'               => 'স্থিতি',
                    'store-view'           => 'চ্যানেলস',
                    'title'                => 'পুশ নোটিফিকেশন',
                    'update-btn-title'     => 'আপডেট করুন',

                    'option-type' => [
                        'category' => 'বিভাগ',
                        'others'   => 'সাধারণ',
                        'product'  => 'পণ্য',
                    ],
                ],

                'not-found'           => 'সতর্কতা: নোটিফিকেশন খুঁজে পাওয়া যায়নি।',
                'create-success'      => 'নোটিফিকেশন সফলভাবে তৈরি হয়েছে।',
                'delete-failed'       => 'নোটিফিকেশন মোছা ব্যর্থ হয়েছে।',
                'delete-success'      => 'নোটিফিকেশন সফলভাবে মোছা হয়েছে।',
                'mass-update-success' => 'নির্বাচিত নোটিফিকেশনগুলি সফলভাবে আপডেট হয়েছে।',
                'mass-delete-success' => 'নির্বাচিত নোটিফিকেশনগুলি সফলভাবে মোছা হয়েছে।',
                'no-value-selected'   => 'কোন বিদ্যমান মান নেই।',
                'send-success'        => 'নোটিফিকেশন সফলভাবে পাঠানো হয়েছে।',
                'update-success'      => 'নোটিফিকেশন সফলভাবে আপডেট হয়েছে।',
                'configuration-error' => 'সতর্কতা: FCM কনফিগারেশন পাওয়া যায়নি।',
                'product-not-found'   => 'সতর্কতা: পণ্য খুঁজে পাওয়া যায়নি।',
                'category-not-found'  => 'সতর্কতা: ক্যাটেগরি খুঁজে পাওয়া যায়নি।',
            ],
        ],

        'response' => [
            'error' => [
                'invalid-parameter' => 'সতর্কতা: অবৈধ প্যারামিটার সরবরাহ করা হয়েছে।',
            ],
        ],
    ],

    'email' => [
        'configuration-error' => 'সতর্কবার্তা: ইমেইল কনফিগারেশন পাওয়া যায়নি।',
    ],
];
