<?php

return [
    'shop' => [
        'subscription' => [
            'already-subscribed' => 'ඔබ අපගේ නිවේදන පත්‍රයට දැනටමත් සාමාජික වී ඇත.',
            'subscribe-success'  => 'ඔබ අපගේ නිවේදන පත්‍රයට සාර්ථකව සාමාජික වී ඇත.',
        ],

        'contact-us' => [
            'thanks-for-contact' => 'අප හා සම්බන්ධ වූවට ස්තුතියි. අපි ඉක්මනින් ඔබ වෙත ප්‍රතිචාර දක්වන්නෙමු.',
        ],

        'downloadable-products' => [
            'download-sample' => [
                'link-not-found'   => 'අවවාදයයි: බාගත කිරීමේ සබැඳිය සොයාගත නොහැක.',
                'sample-not-found' => 'අවවාදයයි: බාගත කළ හැකි නියැදිය සොයාගත නොහැක.',
            ],
        ],

        'customers' => [
            'no-login-customer' => 'සඳහා අවසර නොමැත: පිවිසුම් පරිශීලකයා හමුවුණි.',
            'success-login'     => 'සාර්ථකයි: ප්‍රධාන පැතිකඩෙහි පිවිසුම් සාර්ථකව සිටියි.',
            'success-logout'    => 'සාර්ථකයි: ප්‍රධාන පැතිකඩෙහි පිවිසුම් ඉවත් වී ඇතියි.',

            'signup' => [
                'error-registration' => 'සඳහා අවසර නොමැත: ප්‍රධාන ලියාපදිංචිය අසාර්ථකයි.',
                'success-verify'     => 'ගිණුම සාර්ථකව නිර්මාණය කරන ලදි, තැපැල් මගින් තහවුරු කරන ලදි.',
                'success'            => 'සාර්ථකයි: පාරිභෝගිකයා ලියාපදිංචි වී සාර්ථකව පිවිසෙන්න.',
            ],

            'social-login' => [
                'disabled' => 'අවවාදයයි: සමාජ පිවිසුම අක්‍රීය කර ඇත.',
            ],

            'login' => [
                'invalid-creds' => 'කරුණාකර ඔබේ අත්හිටුවාසිකම් පරිශීලක තහවුරු කර ගන්න.',
                'not-activated' => 'ඔබගේ සක්‍රිය පිළිබඳ අපව අනුමැතිය අවශ්‍ය වේ',
                'verify-first'  => 'කරුණාකර ඔබේ විද්‍යුත්තේ තහවුරු කරන්න.',
                'suspended'     => 'ඔබගේ ගිණුම පරීක්ෂා කළහැකි බවට අමතක වී ඇති බවයි.',

                'validation' => [
                    'required' => ':field ක්ෂේත්‍රය අවශ්‍යයි.',
                    'same'     => ':field සහ මුරපදය ගැලපෙන්න අවසරයි.',
                    'unique'   => 'මෙම :field දැනටමත් භාවිතා කරන ලදි.',
                ],
            ],

            'forgot-password' => [
                'already-sent'    => 'ඔබේ විද්‍යුත්තේ මුරපද යවන ලදි.',
                'email-not-exist' => 'ඊමේල් නොපවතී.',
                'reset-link-sent' => 'ඔබේ විද්‍යුත්තේ මුරපද සඳහා සැලසුම් යවන ලදි.',
            ],

            'account' => [
                'profile' => [
                    'customer-details' => 'සාර්ථකත්වය: පාරිභෝගික විස්තර සාර්ථකව ලබාගන්නා ලදී.',
                    'delete-success'   => 'සාර්ථකත්වය: ගිණුම සාර්ථකව මකා දැමීම.',
                    'password-unmatch' => 'මුරපදය නොගැලපේ.',
                    'update-fail'      => 'අවවාදයයි: පැතිකඩ යාවත්කාලීන කර නොමැත.',
                    'update-success'   => 'සාර්ථකත්වය: පැතිකඩ සාර්ථකව යාවත්කාලීන කරන ලදී.',
                    'wrong-password'   => 'අවවාදයයි: වැරදි මුරපදයක් සපයා ඇත.',
                    'order-pending'    => 'ඔබට ගිණුම මකා දැමිය නොහැකියි මක්නිසාද ඔබට මඳබැඳි ඇණවුම් ඇත.',
                ],

                'addresses' => [
                    'create-success'         => 'සාර්ථකයි: ලිපිනය සාදන ලදි.',
                    'default-update-success' => 'සාර්ථකයි: ලිපිනය පෙරනිමිය වීමට සාර්ථකව සැකසුම් කරන ලදි',
                    'delete-success'         => 'සාර්ථකයි: ලිපිනය සාර්ථකව මකා දමා ඇත.',
                    'not-found'              => 'සඳහා අවසර නොමැත: ලිපිනය හමුවුණි.',
                    'update-success'         => 'සාර්ථකයි: ලිපිනය සාර්ථකව යාවත්කාලීන විය.',
                    'already-default'        => 'අවවාදයයි: මෙම ලිපිනය දැනටමත් පෙරනිමිය ලෙස සකසා ඇත.',
                ],

                'wishlist' => [
                    'product-removed' => 'සඳහා අවසර නොමැත: නොමැති නිශ්චයක් හමුවුණි.',
                    'success'         => 'සාර්ථකයි: නිශ්චය සාර්ථකව රුපියල් එකතු කරන ලදි.',
                    'already-exist'   => 'සඳහා අවසර නොමැත: දැනටමත් රුපියල් එකතු කර ඇති බවයි.',
                    'remove-success'  => 'සාර්ථකයි: නිශ්චය සාර්ථකව රැස්වීමේදී ඉවත් කරන ලදි.',
                    'not-found'       => 'සඳහා අවසර නොමැත: නිශ්චයන් නොමැති බවයි.',
                    'moved-to-cart'   => 'සාර්ථකයි: නිශ්චය සාර්ථකව කාර්ට් එකට එකතු කරන ලදි.',
                ],

                'orders' => [
                    'not-found'      => 'සඳහා අවසර නොමැත: කිසිදු ඇනවුම් හමුවුණි.',
                    'cancel-error'   => 'සඳහා අවසර නොමැත: ඇනවුම අවලංගු කර නොමැතියි.',
                    'cancel-success' => 'සාර්ථකයි: ඇනවුම සාර්ථකව අවලංගු කරන ලදි.',

                    'shipment' => [
                        'not-found' => 'සඳහා අවසර නොමැත: නිශ්චයක් හමුවුණි.',
                    ],

                    'invoice' => [
                        'not-found' => 'සඳහා අවසර නොමැත: ගෙවීම් පත්රය හමුවුණි.',
                    ],

                    'refund' => [
                        'not-found' => 'සඳහා අවසර නොමැත: පිළිතුරු හමුවුණි.',
                    ],
                ],

                'downloadable-products' => [
                    'not-found'      => 'සඳහා අවසර නොමැත: බාගත කිරීමේ නිශ්චයක් හමුවුණි.',
                    'not-auth'       => 'සඳහා අවසර නොමැත: ඔබට මෙම ක්‍රියාකාරකම සඳහා අවසරයි.',
                    'payment-error'  => 'මුදල් ගෙවීම මඟින් මෙම බාගතය සඳහා ගෙවීම නොකර ඇත.',
                    'download-error' => 'බාගත සබැඳිය අවලංගු වී ඇත.',
                ],

                'gdpr' => [
                    'create-success'       => 'සාර්ථකයි: GDPR ඉල්ලීම සාර්ථකව නිර්මාණය විය.',
                    'revoke-failed'        => 'අවවාදයයි: GDPR ඉල්ලීම අවලංගු කළ නොහැක.',
                    'revoked-successfully' => 'සාර්ථකයි: GDPR ඉල්ලීම සාර්ථකව අවලංගු කරන ලදී.',
                    'not-enabled'          => 'අවවාදයයි: GDPR සක්‍රීය කර නොමැත.',
                ],
            ],

            'compare-product' => [
                'not-found'           => 'අවවාදයයි: සැසදීමට වට්ටමක් හමු නොවීය.',
                'product-not-found'   => 'අවවාදයයි: නිෂ්පාදනය හමු නොවීය.',
                'already-added'       => 'අවවාදයයි: නිෂ්පාදනය දැනටමත් සැසදීමේ ලැයිස්තුවට එකතු කර ඇත.',
                'item-add-success'    => 'සාර්ථකයි: නිෂ්පාදනය සැසදීමේ ලැයිස්තුවට සාර්ථකව එකතු කර ඇත.',
                'remove-success'      => 'සාර්ථකයි: අයිතමය සැසදීමේ ලැයිස්තුවෙන් සාර්ථකව ඉවත් කර ඇත.',
                'mass-remove-success' => 'සාර්ථකයි: තෝරාගත් අයිතම සාර්ථකව ඉවත් කර ඇත.',
                'not-auth'            => 'අවවාදයයි: ඔබට මෙම ක්‍රියාව සිදු කිරීමට අවසර නැත.',
            ],

            'reviews' => [
                'create-success'      => 'සාර්ථකයි: සටහන සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-success'      => 'සාර්ථකයි: සටහන සාර්ථකව මකා දමා ඇත.',
                'mass-delete-success' => 'සාර්ථකත්වය: තේරිම් කළ විශ්ලේෂණ සාර්ථකව මකා දමන ලදී.',
                'not-found'           => 'සඳහා අවසර නොමැත: සටහන හමුවුණි.',
                'product-not-found'   => 'අවවාදයයි: නිෂ්පාදනය හමු නොවීය.',
            ],
        ],

        'checkout' => [
            'cart' => [
                'item' => [
                    'error' => [
                        'downloadable-links' => 'අවවාදය: බාගත කිරීමේ සබැඳිය අවලංගු වී ඇත.',
                        'invalid-parameter'  => 'අවවාදය: වැරදි පරාමිතීන් සපයා ඇත.',
                    ],

                    'success' => [
                        'add-to-cart'      => 'සාර්ථකත්වය: නිෂ්පාදනය කාර්ට් එකට සාර්ථකව එකතු කෙරුණා.',
                        'update-to-cart'   => 'සාර්ථකත්වය: නිෂ්පාදනය කාර්ට් එකට සාර්ථකව යාවත්කාලීන කෙරුණා.',
                        'delete-cart-item' => 'සාර්ථකත්වය: නිෂ්පාදනය කාර්ට් එකෙන් සාර්ථකව ඉවත් කෙරුණා.',
                        'all-remove'       => 'සාර්ථකත්වය: සියලුම අයිතම කාර්ට් එකෙන් ඉවත් කෙරුණා.',
                        'move-to-wishlist' => 'සාර්ථකත්වය: තේරීමෙන් ඇති අයිතම සාර්ථකව සුදානමින් ලයිස්තුවට යොමු කෙරුණා.',
                    ],

                    'fail' => [
                        'all-remove'       => 'අවවාදය: සියලුම අයිතම කාර්ට් එකෙන් ඉවත් නොකෙරුණා.',
                        'update-to-cart'   => 'අවවාදය: නිෂ්පාදනය කාර්ට් එකට යාවත්කාලීන නොකෙරුණා.',
                        'delete-cart-item' => 'අවවාදය: අයිතමය කාර්ට් එකෙන් ඉවත් නොකෙරුණා.',
                        'not-found'        => 'අවවාදය: කාර්ට් එක හමු නොවුණා.',
                        'item-not-found'   => 'අවවාදය: අයිතමය හමු නොවුණා.',
                        'move-to-wishlist' => 'අවවාදය: තේරීමෙන් ඇති අයිතම සුදානමින් ලයිස්තුවට යොමු නොකෙරුණා.',
                    ],
                ],
            ],

            'addresses' => [
                'guest-address-warning'     => 'අවවාදය: ආගන්තුක පරිශීලකයාට ලිපිනයක් එක් කරන්න බැහැ.',
                'guest-checkout-warning'    => 'අවවාදය: ආගන්තුක පරිශීලකයාට checkout කරන්න බැහැ.',
                'no-billing-address-found'  => 'අවවාදය: බිල්පත් ලිපිනයක් හමු නොවුණා.',
                'no-shipping-address-found' => 'අවවාදය: ප්‍රවාහන ලිපිනයක් හමු නොවුණා.',
                'address-save-success'      => 'සාර්ථකත්වය: ලිපිනය සාර්ථකව සුරකිණු ලැබිනි.',
            ],

            'shipping' => [
                'method-not-found' => 'අවවාදය: ප්‍රවාහන ක්‍රමයක් හමු නොවුණා.',
                'method-fetched'   => 'සාර්ථකත්වය: ප්‍රවාහන ක්‍රමයක් සාර්ථකව ලබා ගත්තා.',
                'save-failed'      => 'අවවාදය: ප්‍රවාහන ක්‍රමයක් සුරක්ෂිත නොකෙරුණා.',
                'save-success'     => 'සාර්ථකත්වය: ප්‍රවාහන ක්‍රමයක් සාර්ථකව සුරක්ෂිත කෙරුණා.',
            ],

            'payment' => [
                'method-not-found' => 'අවවාදය: ගෙවීමේ ක්‍රමයක් හමු නොවුණා.',
                'method-fetched'   => 'සාර්ථකත්වය: ගෙවීමේ ක්‍රමයක් සාර්ථකව ලබා ගත්තා.',
                'save-failed'      => 'අවවාදය: ගෙවීමේ ක්‍රමයක් සුරක්ෂිත නොකෙරුණා.',
                'save-success'     => 'සාර්ථකත්වය: ගෙවීමේ ක්‍රමයක් සාර්ථකව සුරක්ෂිත කෙරුණා.',
            ],

            'coupon' => [
                'apply-success'   => 'සාර්ථකත්වය: වවුචර් කේතය සාර්ථකව යෙදවීය.',
                'already-applied' => 'අවවාදය: වවුචර් කේතය දැනටමත් යෙදවී ඇත.',
                'invalid-code'    => 'අවවාදය: වවුචර් කේතය වලංගු නැත.',
                'remove-success'  => 'සාර්ථකත්වය: වවුචර් කේතය සාර්ථකව ඉවත් කෙරුණා.',
                'remove-failed'   => 'අවවාදය: වවුචර් කේතය ඉවත් නොකෙරුණා.',
            ],

            'something-wrong'          => 'අවවාදය: යමක් වැරදී ඇත.',
            'invalid-guest-user'       => 'අවවාදය: අවලංගු ආගන්තුක පරිශීලක.',
            'empty-cart'               => 'අවවාදය: කාර්ට් එක හිස්යි.',
            'missing-billing-address'  => 'අවවාදය: බිල්පත් ලිපිනයක් නොමැත.',
            'missing-shipping-address' => 'අවවාදය: ප්‍රවාහන ලිපිනයක් නොමැත.',
            'missing-shipping-method'  => 'අවවාදය: ප්‍රවාහන ක්‍රමයක් නොමැත.',
            'missing-payment-method'   => 'අවවාදය: ගෙවීමේ ක්‍රමයක් නොමැත.',
            'no-address-found'         => 'අවවාදය: බිල්පත් සහ ප්‍රවාහන ලිපිනයක් හමු නොවුණා.',
        ],
    ],

    'admin' => [
        'acl' => [
            'create'            => 'තනන්න',
            'delete'            => 'මකන්න',
            'edit'              => 'සංස්කරණය කරන්න',
            'mass-delete'       => 'සමූහ මකා දැමීම',
            'mass-update'       => 'සමූහ යාවත්කාලීන කිරීම',
            'push-notification' => 'තැටිය දිරිගැන්වීම',
            'send'              => 'යවන්න',
        ],

        'components' => [
            'layouts' => [
                'sidebar' => [
                    'push-notification' => 'තැටිය දිරිගැන්වීම',
                ],
            ],
        ],

        'configuration' => [
            'index' => [
                'general' => [
                    'graphql-api' => [
                        'notification-topic'              => 'දැනුම්දීමේ මාතෘකාව',
                        'info'                            => 'දැනුම්දීම සම්බන්ධව සැකසීම්',
                        'push-notification-configuration' => 'FCM ත්‍රස්තය දැනුම්දීමේ සැකසීම',
                        'title'                           => 'GraphQL API',
                        'private-key'                     => 'පෞද්ගලික යතුර JSON ගොනුවේ අන්තර්ගතය',
                        'info-get-private-key'            => 'විස්තර: FCM පෞද්ගලික යතුර JSON ගොනුවේ අන්තර්ගතය ලබා ගැනීම සඳහා: <a href="https://console.firebase.google.com/" target="_blank">මෙතන ක්ලික් කරන්න</a>',
                    ],

                    'content' => [
                        'custom-script' => [
                            'update-success' => 'සාර්ථකත්වය: රටා අත්පිටපත් සාර්ථකව යාවත්කාලීන කරන ලදී.',
                        ],
                    ],
                ],
            ],
        ],

        'sales' => [
            'orders' => [
                'cancel-error'   => 'විස්තරය: ඇණවුම අවලංගු කළ නොහැක.',
                'cancel-success' => 'සාර්ථකයි: ඇණවුම සාර්ථකව අවලංගු කරන ලදි.',
                'not-found'      => 'විස්තරය: ඇණවුම හමු නොවීය.',
            ],

            'shipments' => [
                'creation-error'   => 'විස්තරය: නිෂ්පාදනය නිර්මාණය කල නොහැක.',
                'not-found'        => 'විස්තරය: නිෂ්පාදනය හමු නොවීය.',
                'quantity-invalid' => 'විස්තරය: වලංගු ප්‍රමාණය වැරදියි.',
                'shipment-error'   => 'විස්තරය: නිෂ්පාදනය නිර්මාණය කල නොහැක.',
                'create-success'   => 'සාර්ථකයි: නිෂ්පාදනය සාර්ථකව නිර්මාණය කරන ලදි.',
            ],

            'invoices' => [
                'creation-error' => 'විස්තරය: ඉන්වොයිස් නිෂ්පාදනය නිර්මාණය කල නොහැක.',
                'not-found'      => 'විස්තරය: ඉන්වොයිස් නිෂ්පාදනය හමු නොවීය.',
                'product-error'  => 'විස්තරය: වලංගු නිෂ්පාදනය සපයා නොමැත.',
                'create-success' => 'සාර්ථකයි: ඉන්වොයිස් නිෂ්පාදනය සාර්ථකව නිර්මාණය කරන ලදි.',
                'invalid-qty'    => 'අවවාදය: අපි අයිතම සඳහා වලංගු නොවන ප්‍රමාණයක් සොයා ගත්තා.',
            ],

            'refunds' => [
                'creation-error'      => 'විස්තරය: ආපසුම් නිෂ්පාදනය නිර්මාණය කල නොහැක.',
                'refund-amount-error' => 'විස්තරය: වලංගු ආපසුම් මුදලක් සපයා නොමැත.',
                'refund-limit-error'  => 'විස්තරය: ආපසුම් මුදල අවලංගු සීමාව ඉක්මවා ඇති බැවින් :amount',
                'not-found'           => 'විස්තරය: ආපසුම් හමු නොවීය.',
                'create-success'      => 'සාර්ථකයි: ආපසුම් නිෂ්පාදනය සාර්ථකව නිර්මාණය කරන ලදි.',
            ],

            'transactions' => [
                'already-paid'   => 'විස්තරය: ඉන්වොයිස් දුරකථනය දැනටමත් ගෙවීමේ අවස්ථාවක් විය.',
                'amount-exceed'  => 'විස්තරය: ගිනුම් මුදල සීමාව අවලංගු වේ.',
                'zero-amount'    => 'විස්තරය: ගිනුම් මුදල් බොහෝ විටක විය යුතුය.',
                'create-success' => 'සාර්ථකයි: ගිනුම් නිෂ්පාදනය සාර්ථකව නිර්මාණය කරන ලදි.',
            ],

            'reorder' => [
                'customer-not-found'       => 'විස්තරය: ප්‍රවාහනය සඳහා ප්‍රවාහනයක් හමු නොවීය.',
                'cart-not-found'           => 'විස්තරය: කර්තෘ හමු නොවීය.',
                'cart-item-not-found'      => 'විස්තරය: කර්තෘ අයිතමය හමු නොවීය.',
                'cart-create-success'      => 'සාර්ථකයි: කර්තෘ සාර්ථකව නිර්මාණය කරන ලදි.',
                'cart-item-add-success'    => 'සාර්ථකයි: නිෂ්පාදනය කරන්නේ කර්තෘට එකතු කිරීමේදී සාර්ථකව එකතු කරන ලදි.',
                'cart-item-remove-success' => 'සාර්ථකයි: අයිතමය කර්තෘවෙන් ඉවත් කිරීම සාර්ථකව නිර්මාණය කරන ලදි.',
                'cart-item-update-success' => 'සාර්ථකයි: නිෂ්පාදනය කරන්නේ කර්තෘට යාවත්කාලීන කිරීමේදී සාර්ථකව එකතු කරන ලදි.',
                'something-wrong'          => 'විස්තරය: දෝෂයක් සිදු වී ඇත.',
                'address-save-success'     => 'සාර්ථකයි: ලිපිනය සුරකින්නේ සාර්ථකව තැන්පිටකයක් ලෙස සුරකින ලදි.',
                'shipping-save-success'    => 'සාර්ථකයි: නිෂ්පාදන ස්ථානය සුරකින්නේ සාර්ථකව තැන්පිටකයක් ලෙස සුරකින ලදි.',
                'payment-save-success'     => 'සාර්ථකයි: ගෙවීම් ස්ථානය සුරකින්නේ සාර්ථකව තැන්පිටකයක් ලෙස සුරකින ලදි.',
                'order-placed-success'     => 'සාර්ථකයි: ඇණවුම සාර්ථකව ස්ථාපනය කරන ලදි.',
                'payment-method-not-found' => 'විස්තරය: ගෙවීම් ක්රමය හමු නොවීය.',
                'minimum-order-amount-err' => 'විස්තරය: අවම ප්‍රමාණය ප්‍රමාණය අඩු විය යුතුයි :amount',
                'check-shipping-address'   => 'විස්තරය: නිෂ්පාදන ලිපිනය පරීක්ෂා කරන්න.',
                'check-billing-address'    => 'විස්තරය: බිල් ලිපිනය පරීක්ෂා කරන්න.',
                'specify-shipping-method'  => 'විස්තරය: නිෂ්පාදන ක්රමය විස්තර කරන්න.',
                'specify-payment-method'   => 'විස්තරය: ගෙවීම් ක්රමය විස්තර කරන්න.',
                'coupon-not-valid'         => 'විස්තරය: වලංගු ප්‍රවර්ගයේ කූපනය වලක්ෂයි.',
                'coupon-already-applied'   => 'විස්තරය: කූපනය දැනටමත් අයුතු කර ඇත.',
                'coupon-applied'           => 'සාර්ථකයි: කූපනය සාර්ථකව අයුතු කරන ලදි.',
                'coupon-removed'           => 'සාර්ථකයි: කූපනය සාර්ථකව ඉවත් කරන ලදි.',
            ],
        ],

        'catalog' => [
            'products' => [
                'create-success'            => 'නිෂ්පාදනය සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-success'            => 'නිෂ්පාදනය සාර්ථකව මකා දමන ලදි',
                'not-found'                 => 'අවසර: නිෂ්පාදනය හමු නොවීය.',
                'update-success'            => 'නිෂ්පාදනය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'configurable-attr-missing' => 'අවසර: විකල්ප ක්රමවේදය අසාර්ථකයි.',
                'simple-products-error'     => 'අවසර: සරල නිෂ්පාදන නොමැත.',
            ],

            'categories' => [
                'already-taken'  => 'අවසර: පැරණි ස්ලගය දැනටමත් භාවිතා කරන ලදි.',
                'create-success' => 'ප්‍රවර්ගය සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-success' => 'ප්‍රවර්ගය සාර්ථකව මකා දමන ලදි',
                'not-found'      => 'අවසර: ප්‍රවර්ගය හමු නොවීය.',
                'update-success' => 'ප්‍රවර්ගය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'root-delete'    => 'අවසර: මූලික ප්‍රවර්ගය මකා දැමීමට නොහැක.',
            ],

            'attributes' => [
                'create-success'    => 'සාමාන්‍යයෙන් සාදන ලදි.',
                'delete-success'    => 'සාමාන්‍යයෙන් මකා දමන ලදි',
                'not-found'         => 'අවසර: සාමාන්‍යය හමු නොවීය.',
                'update-success'    => 'සාමාන්‍යයෙන් යාවත්කාලීන කරන ලදි.',
                'user-define-error' => 'අවසර: ඔබට පද්ධතියේ සාදන සාමාන්‍යය මකා දැමීමට අවසර නොමැත.',
            ],

            'attribute-groups' => [
                'create-success'    => 'සාමාන්‍ය කණ්ඩායම සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-success'    => 'සාමාන්‍ය කණ්ඩායම සාර්ථකව මකා දමන ලදි',
                'not-found'         => 'අවසර: සාමාන්‍ය කණ්ඩායම හමු නොවීය.',
                'update-success'    => 'සාමාන්‍ය කණ්ඩායම සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'user-define-error' => 'අවසර: ඔබට පද්ධතියේ සාදන සාමාන්‍ය කණ්ඩායම මකා දැමීමට අවසර නොමැත.',
            ],

            'attribute-families' => [
                'create-success'          => 'සාමාන්‍ය පවුල සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-success'          => 'සාමාන්‍ය පවුල සාර්ථකව මකා දමන ලදි',
                'not-found'               => 'අවසර: සාමාන්‍ය පවුල හමු නොවීය.',
                'update-success'          => 'සාමාන්‍ය පවුල සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'last-delete-error'       => 'අවසර: අවසාන සාමාන්‍ය පවුල මකා දැමීමට නොහැක.',
                'attribute-product-error' => 'අවසර: ප්‍රවාහන(s) සම්බන්ධයෙන් මෙම සාමාන්‍ය පවුල සම්බන්ධවීමට භාවිතා කරයි.',
                'user-define-error'       => 'අවසර: ඔබට පද්ධතියේ සාදන සාමාන්‍ය පවුල මකා දැමීමට අවසර නොමැත.',
            ],
        ],

        'customers' => [
            'customers' => [
                'create-success'       => 'ප්‍රායෝගික සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-order-pending' => 'ඇණවුම(හෝ සක්‍රිය ප්‍රමාණයක්) සිදු වී ඇති අයිතමයන් ඇතුළත් කිරීමේ අයිතමය මකා දැමීමට නොහැක.',
                'delete-success'       => 'ප්‍රායෝගිකයා සාර්ථකව මකා දමන ලදි',
                'not-found'            => 'අවසර: ප්‍රායෝගිකයා හමු නොවීය.',
                'note-created-success' => 'අටුව සාර්ථකව නිර්මාණය කරන ලදි',
                'update-success'       => 'ප්‍රායෝගිකයා සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'login-success'        => 'ප්‍රායෝගිකයා සාර්ථකව පුරනය වීමේ සාර්ථකව ඇතුලත් කරන ලදි.',
            ],

            'addresses' => [
                'create-success'         => 'ප්‍රායෝගිකයේ ලිපිනය සාර්ථකව නිර්මාණය කරන ලදි.',
                'default-update-success' => 'ලිපිනය පෙරනිමිය ලෙස සකස් කරන ලදි',
                'delete-success'         => 'ප්‍රායෝගිකයේ ලිපිනය සාර්ථකව මකා දමන ලදි',
                'not-found'              => 'අවසර: ප්‍රායෝගිකයේ ලිපිනය හමු නොවීය.',
                'update-success'         => 'ප්‍රායෝගිකයේ ලිපිනය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'already-default'        => 'අවවාදයයි: මෙම ලිපිනය දැනටමත් පෙරනිමිය ලෙස සකසා ඇත.',
            ],

            'groups' => [
                'create-success'     => 'ප්‍රායෝගික කණ්ඩායම සාර්ථකව නිර්මාණය කරන ලදි.',
                'customer-associate' => 'අවවාදයයි: කරුණාකර ප්‍රවාහනය සම්බන්ධ කරන ලෙස කාණ්ඩය මකා දැමීමට නොහැක.',
                'delete-success'     => 'ප්‍රායෝගික කණ්ඩායම සාර්ථකව මකා දමන ලදි',
                'not-found'          => 'අවසර: ප්‍රායෝගික කණ්ඩායම හමු නොවීය.',
                'update-success'     => 'ප්‍රායෝගික කණ්ඩායම සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'user-define-error'  => 'අවසර: ඔබට පද්ධතියේ සාදන සාමාන්‍ය කණ්ඩායම මකා දැමීමට අවසර නොමැත.',
            ],

            'reviews' => [
                'delete-success' => 'විස්තරය සාර්ථකව මකා දමන ලදි',
                'not-found'      => 'අවසර: විස්තරය හමු නොවීය.',
                'update-success' => 'විස්තරය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'gdpr' => [
                'delete-success' => 'සාර්ථකයි: GDPR ඉල්ලීම සාර්ථකව මකා ඇත.',
                'not-found'      => 'අවවාදය: GDPR ඉල්ලීම හමු නොවීය.',
                'update-success' => 'GDPR ඉල්ලීම සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],
        ],

        'cms' => [
            'already-taken'  => 'විස්තරය: පැරණි නිර්මාණය දැනටමත් භාවිතා කරන ලදි.',
            'create-success' => 'CMS සාර්ථකව නිර්මාණය කරන ලදි.',
            'delete-success' => 'CMS සාර්ථකව මකා දමන ලදි',
            'not-found'      => 'විස්තරය: CMS හමු නොවීය.',
            'update-success' => 'CMS සාර්ථකව යාවත්කාලීන කරන ලදි.',
        ],

        'marketing' => [
            'promotions' => [
                'catalog-rules' => [
                    'create-success' => 'ප්‍රවාහන රූල් සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-failed'  => 'විස්තරය: ප්‍රවාහන රූල් මකා දැමීම අසාර්ථකයි',
                    'delete-success' => 'ප්‍රවාහන රූල් සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: ප්‍රවාහන රූල් හමු නොවීය.',
                    'update-success' => 'ප්‍රවාහන රූල් සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'cart-rules' => [
                    'create-success' => 'කර්තෘ රූල් සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-failed'  => 'විස්තරය: කර්තෘ රූල් මකා දැමීම අසාර්ථකයි',
                    'delete-success' => 'කර්තෘ රූල් සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'කර්තෘ රූල් විස්තරය හමු නොවීය',
                    'update-success' => 'කර්තෘ රූල් සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],
            ],

            'communications' => [
                'email-templates' => [
                    'create-success' => 'ලිපිනය ආරම්භ කිරීම සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'ලිපිනය සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: ලිපිනය හමු නොවීය.',
                    'update-success' => 'ලිපිනය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'events' => [
                    'create-success' => 'ස්වාධීනය සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'ස්වාධීනය සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: ස්වාධීනය හමු නොවීය.',
                    'update-success' => 'ස්වාධීනය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'campaigns' => [
                    'create-success' => 'සැපයුම්කරුවන් සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'සැපයුම්කරුවන් සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: සැපයුම්කරුවන් හමු නොවීය.',
                    'update-success' => 'සැපයුම්කරුවන් සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'subscriptions' => [
                    'delete-success'      => 'සාමාන්‍යයෙන් ඉවත් කරන ලදි',
                    'not-found'           => 'විස්තරය: සාමාන්‍යයෙන් හමු නොවීය.',
                    'unsubscribe-success' => 'සාමාන්‍යයෙන් ඉවත් කරන ලදි.',
                ],
            ],

            'seo' => [
                'url-rewrites' => [
                    'create-success' => 'URL නැවත ලියාපදිංචි කිරීම සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'URL නැවත ලියාපදිංචි කිරීම සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: URL නැවත ලියාපදිංචි කිරීම හමු නොවීය.',
                    'update-success' => 'URL නැවත ලියාපදිංචි කිරීම සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'search-terms' => [
                    'create-success' => 'සෙවුම් අක්ෂර සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'සෙවුම් අක්ෂර සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: සෙවුම් අක්ෂර හමු නොවීය.',
                    'update-success' => 'සෙවුම් අක්ෂර සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'search-synonyms' => [
                    'create-success' => 'සෙවුම් සමික්ෂණය සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'සෙවුම් සමික්ෂණය සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: සෙවුම් සමික්ෂණය හමු නොවීය.',
                    'update-success' => 'සෙවුම් සමික්ෂණය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],

                'sitemaps' => [
                    'create-success' => 'සයිම් මාපටැයේ සාර්ථකව නිර්මාණය කරන ලදි.',
                    'delete-success' => 'සයිම් මාපටැයේ සාර්ථකව මකා දමන ලදි',
                    'not-found'      => 'විස්තරය: සයිම් මාපටැයේ හමු නොවීය.',
                    'update-success' => 'සයිම් මාපටැයේ සාර්ථකව යාවත්කාලීන කරන ලදි.',
                ],
            ],
        ],

        'settings' => [
            'locales' => [
                'create-success'       => 'භාෂා සාර්ථකව සාදන ලදි.',
                'default-delete-error' => 'සාමාන්‍ය භාෂාව මකා දැමීමට නොහැක.',
                'delete-error'         => 'භාෂාව මකා දැමීම අසාර්ථකයි.',
                'delete-success'       => 'භාෂාව සාර්ථකව මකා දමන ලදි.',
                'last-delete-error'    => 'අවසර: අවසාන භාෂාව මකා දැමීමට නොහැක.',
                'not-found'            => 'විස්තරය: භාෂාව හමු නොවීය.',
                'update-success'       => 'භාෂාව සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'currencies' => [
                'create-success'       => 'විකල්ප සාර්ථකව සාදන ලදි.',
                'default-delete-error' => 'සාමාන්‍ය විකල්පය මකා දැමීමට නොහැක.',
                'delete-error'         => 'විකල්පය මකා දැමීම අසාර්ථකයි.',
                'delete-success'       => 'විකල්පය සාර්ථකව මකා දමන ලදි.',
                'last-delete-error'    => 'අවසර: අවසාන විකල්පය මකා දැමීමට නොහැක.',
                'not-found'            => 'විස්තරය: විකල්පය හමු නොවීය.',
                'update-success'       => 'විකල්පය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'exchange-rates' => [
                'create-success'          => 'ගිවිසුම් අනුවාදය සාර්ථකව සාදන ලදි.',
                'delete-error'            => 'ගිවිසුම් අනුවාදය මකා දැමීම අසාර්ථකයි.',
                'delete-success'          => 'සාර්ථකයි: ගිවිසුම් අනුවාදය සාර්ථකව මකා දමන ලදි.',
                'invalid-target-currency' => 'වැරදි ඉලක්කයේ අයිතමය සපයන්නේ නැත.',
                'last-delete-error'       => 'අවසර: අවසාන ගිවිසුම් අනුවාදය මකා දැමීමට නොහැක.',
                'not-found'               => 'විස්තරය: ගිවිසුම් අනුවාදය හමු නොවීය.',
                'update-success'          => 'ගිවිසුම් අනුවාදය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'inventory-sources' => [
                'create-success'    => 'හිතවතුන් සාර්ථකව සාදන ලදි.',
                'delete-error'      => 'හිතවතුන් මකා දැමීම අසාර්ථකයි.',
                'delete-success'    => 'හිතවතුන් සාර්ථකව මකා දමන ලදි',
                'last-delete-error' => 'අවසර: අවසාන හිතවතුන් මකා දැමීමට නොහැක.',
                'not-found'         => 'විස්තරය: හිතවතුන් හමු නොවීය.',
                'update-success'    => 'හිතවතුන් සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'channels' => [
                'create-success'       => 'චැනලය සාර්ථකව සාදන ලදි.',
                'default-delete-error' => 'සාමාන්‍ය චැනලය මකා දැමීමට නොහැක.',
                'delete-error'         => 'චැනලය මකා දැමීම අසාර්ථකයි.',
                'delete-success'       => 'චැනලය සාර්ථකව මකා දමන ලදි',
                'last-delete-error'    => 'අවසර: අවසාන චැනලය මකා දැමීමට නොහැක.',
                'not-found'            => 'විස්තරය: චැනලය හමු නොවීය.',
                'update-success'       => 'චැනලය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'users' => [
                'activate-warning'  => 'ඔබගේ ගිණුම තවමත් සක්‍රිය කර නොමැත, කරුණාකර පරිපාලකයාට අමතන්න.',
                'create-success'    => 'පරිශීලක සාර්ථකව සාදන ලදි.',
                'delete-error'      => 'පරිශීලක මකා දැමීම අසාර්ථකයි.',
                'delete-success'    => 'පරිශීලක සාර්ථකව මකා දමන ලදි',
                'last-delete-error' => 'අවසර: අවසාන පරිශීලක මකා දැමීමට නොහැක.',
                'login-error'       => 'කරුණාකර ඔබගේ අංකය සහ මුරපදය පරිවර්තනය කරන්න.',
                'not-found'         => 'විස්තරය: පරිශීලක හමු නොවීය.',
                'success-login'     => 'සාර්ථකයි: පරිශීලක පුරනය සාර්ථකව සිටියාවක් ලබා දුන්නේ.',
                'success-logout'    => 'සාර්ථකයි: පරිශීලක පුරනය සාර්ථකව ඉවත් වීමක් ලබා දුන්නේ.',
                'update-success'    => 'පරිශීලක සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'roles' => [
                'create-success'    => 'භූමිකාව සාර්ථකව සාදන ලදි.',
                'delete-error'      => 'භූමිකාව මකා දැමීම අසාර්ථකයි.',
                'delete-success'    => 'භූමිකාව සාර්ථකව මකා දමන ලදි',
                'last-delete-error' => 'අවසර: අවසාන භූමිකාව මකා දැමීමට නොහැක.',
                'not-found'         => 'විස්තරය: භූමිකාව හමු නොවීය.',
                'update-success'    => 'භූමිකාව සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'themes' => [
                'create-success' => 'තේමාව සාර්ථකව සාදන ලදි.',
                'delete-success' => 'තේමාව සාර්ථකව මකා දමන ලදි',
                'not-found'      => 'විස්තරය: ୀතේමාව හමු නොවීය.',
                'update-success' => 'තේමාව සාර්ථකව යාවත්කාලීන කරන ලදි.',

                'validation' => [
                    'filter-input' => [
                        'category-not-exist'    => 'දක්වා ඇති category_id පවතින නැත.',
                        'invalid-boolean-value' => ':key අගය 0 හෝ 1 විය යුතුය.',
                        'invalid-filter-key'    => 'ෆිල්ටර් යතුර ":key" ඉඩ නොදේ.',
                        'invalid-limit-value'   => 'සීමා අගය පහත ඇතිව තිබිය යුතුය: :options.',
                        'invalid-select-option' => ':key අගය වලංගු නොවේ. වලංගු විකල්ප: :options.',
                        'invalid-sort-value'    => 'වරිගත අගය පහත තිබිය යුතුය: :options.',
                        'missing-limit-key'     => 'filtersInput තුළ "limit" යතුර අඩංගු විය යුතුය.',
                        'missing-sort-key'      => 'filtersInput තුළ "sort" යතුර අඩංගු විය යුතුය.',
                    ],
                ],
            ],

            'tax-rates' => [
                'create-success' => 'බද්ධ අනුවාදය සාර්ථකව සාදන ලදි.',
                'delete-error'   => 'බද්ධ අනුවාදය මකා දැමීම අසාර්ථකයි.',
                'delete-success' => 'බද්ධ අනුවාදය සාර්ථකව මකා දමන ලදි',
                'not-found'      => 'විස්තරය: බද්ධ අනුවාදය හමු නොවීය.',
                'update-success' => 'බද්ධ අනුවාදය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'tax-category' => [
                'create-success'     => 'බදු කාණ්ඩය සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-error'       => 'බදු කාණ්ඩය මකා දැමීම අසාර්ථක විය.',
                'delete-success'     => 'බදු කාණ්ඩය සාර්ථකව මකා දැමුණා.',
                'not-found'          => 'අවවාදය: බදු කාණ්ඩය හමු නොවුණා.',
                'tax-rate-not-found' => 'දැමූ අංක නොමැත. අංක:- :ids',
                'update-success'     => 'බදු කාණ්ඩය සාර්ථකව යාවත්කාලීන කරන ලදි.',
            ],

            'notification' => [
                'index' => [
                    'add-title' => 'තැටිය එකතු කරන්න',
                    'general'   => 'සාමාන්‍ය',
                    'title'     => 'තැටිය දිරිගැන්වීම',

                    'datagrid' => [
                        'channel-name'         => 'චැනල් නාමය',
                        'created-at'           => 'සෘජු කලේ',
                        'delete'               => 'මකන්න',
                        'id'                   => 'අංකය',
                        'image'                => 'රූපය',
                        'notification-content' => 'තැටිය අන්තර්ගතය',
                        'notification-status'  => 'තැටිය අස්ථාවරතාවය',
                        'notification-type'    => 'තැටිය වර්ගය',
                        'text-title'           => 'ශීර්ෂය',
                        'update'               => 'යාවත්කාලීන කරන්න',
                        'updated-at'           => 'යාවත්කාලීන කලේ',

                        'status' => [
                            'disabled' => 'අක්‍රීය',
                            'enabled'  => 'සක්‍රීය',
                        ],
                    ],
                ],

                'create' => [
                    'back-btn'             => 'පසුබැසීම',
                    'content-and-image'    => 'තැටිය අන්තර්ගතය සහ රූපය',
                    'create-btn-title'     => 'තැටිය සුරක්ෂිත කරන්න',
                    'general'              => 'සාමාන්‍ය',
                    'image'                => 'රූපය',
                    'new-notification'     => 'නව තැටිය',
                    'notification-content' => 'තැටිය අන්තර්ගතය',
                    'notification-type'    => 'තැටිය වර්ගය',
                    'product-cat-id'       => 'නිෂ්පාදන/වර්ග අංකය',
                    'settings'             => 'සැකසුම්',
                    'status'               => 'අස්ථාවරතාවය',
                    'store-view'           => 'චැනල්',
                    'title'                => 'තැටිය දිරිගැන්වීම',

                    'option-type' => [
                        'category' => 'වර්ගය',
                        'others'   => 'සරල',
                        'product'  => 'නිෂ්පාදන',
                    ],
                ],

                'edit' => [
                    'back-btn'             => 'පසුබැසීම',
                    'content-and-image'    => 'තැටිය අන්තර්ගතය සහ රූපය',
                    'edit-notification'    => 'තැටිය සංස්කරණය කරන්න',
                    'general'              => 'සාමාන්‍ය',
                    'image'                => 'රූපය',
                    'notification-content' => 'තැටිය අන්තර්ගතය',
                    'notification-type'    => 'තැටිය වර්ගය',
                    'product-cat-id'       => 'නිෂ්පාදන/වර්ග අංකය',
                    'send-title'           => 'තැටිය යවන්න',
                    'settings'             => 'සැකසුම්',
                    'status'               => 'අස්ථාවරතාවය',
                    'store-view'           => 'චැනල්',
                    'title'                => 'තැටිය දිරිගැන්වීම',
                    'update-btn-title'     => 'යාවත්කාලීන කරන්න',

                    'option-type' => [
                        'category' => 'වර්ගය',
                        'others'   => 'සරල',
                        'product'  => 'නිෂ්පාදන',
                    ],
                ],

                'not-found'           => 'අවවාදය: තැටිය හමු නොවුණා.',
                'create-success'      => 'තැටිය සාර්ථකව නිර්මාණය කරන ලදි.',
                'delete-failed'       => 'තැටිය මකා දැමීම අසාර්ථක විය.',
                'delete-success'      => 'තැටිය සාර්ථකව මකා දැමුණා.',
                'mass-update-success' => 'තේරීම් කළ තැටියන් සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'mass-delete-success' => 'තේරීම් කළ තැටියන් සාර්ථකව මකා දැමුණා.',
                'no-value-selected'   => 'පවතින වටිනාකමක් නැත.',
                'send-success'        => 'තැටිය සාර්ථකව යවන්න.',
                'update-success'      => 'තැටිය සාර්ථකව යාවත්කාලීන කරන ලදි.',
                'configuration-error' => 'අවවාදය: FCM වින්‍යාසය හමු නොවුණා.',
                'product-not-found'   => 'අවවාදය: නිෂ්පාදනය හමු නොවුණා.',
                'category-not-found'  => 'අවවාදය: වර්ගය හමු නොවුණා.',
            ],
        ],

        'response' => [
            'error' => [
                'invalid-parameter' => 'අවවාදය: වැරදි පරාමිතීන් සපයා ඇත.',
            ],
        ],
    ],

    'email' => [
        'configuration-error' => 'අවවාදය: විද්‍යුත් තැපැල් සැකසුම සොයාගන්න බැහැ.',
    ],
];
